---
kind: property
id: P:Autodesk.Revit.DB.FilterGlobalParameterAssociationRule.RuleValue
source: html/efa39aad-910b-b036-255d-3ad2e8a6f0dc.htm
---
# Autodesk.Revit.DB.FilterGlobalParameterAssociationRule.RuleValue Property

The user-supplied global parameter value against which values from a Revit document will be tested.

## Syntax (C#)
```csharp
public ElementId RuleValue { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null